puts "Привіт САШКО як справи ???
Ось вчуся писати елементарні программи
Пройшов трохи роліків але поки дивлюся уроки з Ютуба Хороший программист
Але до спави хочу тобі предложити пройти маленький квест
відповідь в кінці тобі сподобається. Я думаю.Вибирай 2 відповыдь бо ще я не дуже пишу.
1. Тобі не цікаво.
2. Да цікаво говори скоріше."

choice = gets.chomp

if choice == "1"
	abort "я тобі скажу навіть якщо ти не хочеш цього знати. Спробуй ще"
else 
	puts "Сьогодні дружина їздила в Вінницю Навіщо?
1. Вона іздила на базар
2. Вона їздила на УЗІ"

choice == gets.chomp
if choice == "1" 
   abort "Да на базары вона теж була Але ми не про те"
else 
	puts "Узы скало що у нас буде
1. В нас буде хлопчик
2. В нас буде дівчинка"

choice == gets.chomp
if choice == "1"
   abort "Не угадав.Давай ще раз." 
else
puts "Правильно в нас буде дівчинка"	
end
end
end
